#pandas

In [7]:
#import pandas
import pandas as pd

In [9]:
#import pandas 
import pandas as pd

In [11]:
#empty DataFrame
df= pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [15]:
city = ['dhaka','rangpur','shylhet','khulna']
city

['dhaka', 'rangpur', 'shylhet', 'khulna']

In [25]:
df = pd.DataFrame(city)
df

         0
0    dhaka
1  rangpur
2  shylhet
3   khulna

In [29]:
type(df)

pandas.core.frame.DataFrame

In [31]:
#DataFrame Shape
df.shape

(4, 1)

In [35]:
#dataFrame row column shape
row, col = df.shape

In [37]:
row

4

In [39]:
col

1

In [43]:
pd.DataFrame(city, columns= ['city_name'])

  city_name
0     dhaka
1   rangpur
2   shylhet
3    khulna

In [45]:
#area List
area = [220,263,52,635]

In [59]:
# two dimentional 
df2 = pd.DataFrame(zip(city,area), columns =['city','area'])
df2

      city  area
0    dhaka   220
1  rangpur   263
2  shylhet    52
3   khulna   635